// created 08.03.2021
package Beyts_Sierra_Java.Chapter_5_PowerfullMetods_MakePrograms;

public class a04_SimpleDotComGame {
    public static void main(String[] args) {
        // создаём новый экземпляр класса SimpleDotCom4;
        // объявляем пременную типа int numOfGuesses для хранения количества ходов пользователя;
        // вычисляем случайное число от 0 до 4 для определения места расположения ячейки
        // создаём целочисленный массив с 3-мя элементами используя сгенерированное случайным образом число и увеличиваем его на 1 потом на 2 например (3,4,5)
        // вызываем метод setLocationsCells() из экземпляра SimpleDotCom4
        // бъявляем булеву переменную isActive для хранения состояния игры. Присваиваем ей значение true

        // пока сайт не отоплен isActive == true;
            // получаем пользовательский ввод из командной строки;
            // вызываем метов checkYourself() из экземпляра SimpleDotCom4;
            // инкрементируем переменную numOfGuess;
            // проверяем не потоплен ли сайт
            // если результат равен Пототпил
                // присваиваем переменной isActive начение false
                // выводим колличество попыток
    }
}

class SimpleDotCom4{

}