// created 10.03.2021
package Sedjvic_R.libraries.Chapter_01_FirstProgram.Subchapter_1_2;

//1.2.35. Кривая дракона. Напишите программу, которая выводит инструкции для
//рисования кривых дракона разного порядка, от 0 до 5. Инструкции выглядят как
//цепочки символов F, L и R, где F означает «нарисовать
//линию на 1 единицу вперед», L — «повернуть
//налево», a R — «повернуть направо». Чтобы
//получить кривую дракона порядка п, сложите
//полоску бумаги пополам п раз, а затем разверните
//с прямыми углами. Чтобы решить эту задачу,
//заметим, что кривая порядка п является кривой
//порядка п - 1, за которой следует инструкция L
//и кривая порядка п - 1, обходимая в обратном
//порядке (далее аналогичное описание строится
//для обратной кривой).

import javax.swing.JFrame;

public class a31_DragonCurve extends JFrame {

}